#Eclipse modern messages class
Overview=\u00DCbersicht
StateKey=Schl\u00fcssel Paar
StateNewMsg=Neue Nachricht
StateSignMsg=Nachricht Signieren
StateVerOMsg=Nachricht Verifizieren
StateRedMsg=Nachricht Schw\u00e4rzen
StateVerRMsg=Geschw\u00e4rztes Verifizieren
DataBoxKey=Schl\u00fcssel Paar
DataBoxOrig=Signierte Nachricht
DataBoxRed=Geschw\u00e4rzte Nachricht
SelectKeySize=Wähle eine Key Größe:
TakesLongTime=(dauert ziemlich lange)
GenerateKey=Key generieren
Next=Weiter
NewMessage=Neue Nachricht
SetMessages=Nachrichten setzen
AddMessagePart=Weitere Nachrichtenteil hinzuf\u00fcgen.
PasteYour=Nachicht
PartHere=hier setzen
ConfirmMessages=Gesetzte Nachrichten best\u00e4tigen
AddMessageButtonLabel=Zus\u00e4tzliche Nachrichten mit diesem Knopf hinzuf\u00fcgen.
SelectFixedParts=Fixe Nachrichten ausw\u00e4hlen.
SelectPartsInfoText=Nachrichte, die fix sind, k\u00f6nnen später nicht mehr geschw\u00e4rzt werden.
SignMessage=Nachrichten signieren
VerifyMessage=Nachrichten verifizieren
VerifyMessageInfoText=Versuchen Sie die Nachrichten zu ver\u00e4ndern, um zu sehen, ob sie dann noch verifizieren.
Message=Nachricht
Reset=Originale Nachricht wiederherstellen
RedactMessages=Nachrichtenteile schw\u00e4rzen
VerifyRedacted=Redactedes Dokument verifizieren
Fix=Fix
Number=Nummer
Redact=Schw\u00e4rzen
Redactable=Schw\u00e4rzbar
ReturnButton=Zur\u00fcck
Yes=Ja
No=Nein
IsVerified=Ist verifiziert
MessagePart=Nachrichtenteil
Redacted=geschw\u00e4rzt
Help=Hilfe
About=Info
ViewKey=Signatur-Key Informationen
KeyLength=Key L\u00e4nge
KeyType=Key-Typ
KeyPair=Key-Pair
PrivateKey=Privater Schl\u00fcssel(geheim)
PublicKey=Öffentlicher Schl\u00fcssel
ProofPart=Proof
ViewMessage=Original Nachricht
ViewRedacted=Geschw\u00e4rzte Nachricht anzeigen
TextSetKey=Der erste Schritt ist die Crypto mit einem passenden Schl\u00fcssel aufzusetzen. W\u00e4len Sie die Schl\u00fcssegr\u00f6\u00df aus und best\u00e4tigen Sie.
TextSetMessage=F\u00fcgen Sie die Nachrichtenteile in die Text-Boxen ein. Sie als Benutzer müssen entscheiden, wie die Originalnachricht in Teile zerlegt wird.
TextSignMessage=W\u004ehlen Sie die Nachrichtenteile aus, die schw\u00e4rzbar sein sollen. Eine dritte Person darf dann schw\u00e4rzbare Nachrichtenteile entfernen, ohne die Signatur der Nachricht ung\u00fcltig zu machen.
TextVerifyMessage=Versuchen Sie die Nachrichtenteile zu ver\u00e4ndern und achten Sie darauf, ob die Nachricht nach Ver\u00e4nderungen noch g\u00fcltig ist.
TextRedact=W\u004ehlen Sie die Nachrichtenteile aus, die im n\u00e4chsten Schritt geschw\u00e4rzt werden sollen. Geschw\u00e4rzte Nachrichtenteile werden f\u00fcr immer aus der nachricht gel\u00f6scht.
TextVerifyRedacted=Wenn Sie im letzten Schritt Nachrichtenteile geschw\u00e4rzt haben, sind diese jetzt nicht mehr vorhaden. Versuchen Sie die Nachrichtenteile zu ver\u00e4ndern und achten Sie darauf, ob die Nachricht nach Ver\u00e4nderungen noch g\u00fcltig ist.
TextViewKey=Hier stehen einige Informationen \u00fcber die kryptographischen Schl\u00fcssel, die verwendet werden, unter anderem der Schl\u00fcsseltyp, seine Gr\u00f6\u00dfe und der private als auch der \u00f6ffentliche Schl\u00fcssel in Textform.
TextViewMessage=Hier sehen Sie die Originalnachricht, bzw. die Originalnachrichtenteile, welche Sie zu Beginn eingegeben haben.
TextViewRedacted=Hier sehen Sie die Nachricht, bez. die Nachrichtenteile, im jetzigen Status des Ablaufes.

AlgorithmSettings=Algorithmus Einstellungen
SelectAlgorithmVariant=Wähle eine Algorithmusvariante:

Title=Redactable Signature Schemes
Description=In dieser Visualisierung wird das Redactable signature scheme (=RSS) veranschaulicht. Es kann ein neuer Schlüssel erzeugt werden, Nachrichtenteile eingegeben werden und es kann ausgeählt werden, welche Nachrichtenteile im Nachhinein gelöscht werden können. Dann kann die Nachricht signiert werden. Nun können die Nachrichtenteile beliebig oft verifiziert werden und teile entfernt (=redact) werden. 